const config = require('../config');
const { cmd, commands } = require('../command');
const os = require("os");
const { runtime } = require('../lib/functions');

cmd({
    pattern: "menu",
    alias: ["list"],
    desc: "menu the bot",
    react: "📃",
    category: "main"
}, async (conn, mek, m, {
    from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply
}) => {
    try {
        let desc = `*╭─────❒*
*┃*  👋 Hello ${pushname}
*╰─────❒*

*╭──⛬ ᴄᴏᴍᴍᴀɴᴅ ᴘᴀɴᴇʟ ⛬*
*│*  *ʀᴜɴᴛɪᴍᴇ :* ${runtime(process.uptime())}
*│*  *ʀᴀᴍ ᴜꜱᴀɢᴇ :* ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB
*│*  *ᴘʟᴀᴛꜰᴏʀᴍ :* ${os.hostname()}
*│*  *ᴠᴇʀꜱɪᴏɴ :* 1.0.0
*╰──────────────────❒*

╭────────៚
┃✯╭──❥
┃✯│ *➀ .ᴏᴡɴᴇʀ*
┃✯│ *➁ .ᴄᴏɴᴠᴇʀᴛ*
┃✯│ *➂ .ᴀɪ*  
┃✯│ *➃ .ꜱᴇᴀʀᴄʜ*
┃✯│ *➄ .ᴅᴏᴡɴʟᴏᴀᴅ*
┃✯│ *➅ .ᴍᴀɪɴ*
┃✯│ *➆ .ɢʀᴏᴜᴘ*
┃✯│ *➇ .ꜰᴜɴ*
┃✯│ *➈ .ᴛᴏᴏʟꜱ*
┃✯│ *➉ .ᴏᴛʜᴇʀ*
┃✬╰──────────❥
╰───────────────────៚

*🪄 𝚁𝙴𝙿𝙻𝚈 𝚆𝙸𝚃𝙷 𝚃𝙷𝙴 𝙽𝚄𝙼𝙱𝙴𝚁 𝚈𝙾𝚄 𝚆𝙰𝙽𝚃 𝚃𝙾 𝚂𝙴𝙻𝙴𝙲𝚃 🖋️*

 > © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`;

        const vv = await conn.sendMessage(from, { image: { url: "https://i.ibb.co/xt0nMfDy/IMG-20250426-WA0030.jpg" }, caption: desc }, { quoted: mek });

        conn.ev.on('messages.upsert', async (msgUpdate) => {
            const msg = msgUpdate.messages[0];
            if (!msg.message || !msg.message.extendedTextMessage) return;

            const selectedOption = msg.message.extendedTextMessage.text.trim();

            if (msg.message.extendedTextMessage.contextInfo && msg.message.extendedTextMessage.contextInfo.stanzaId === vv.key.id) {
                switch (selectedOption) {
                    case '1':
                        reply(`*╭───────────❒*
*┃* *𝙾𝚆𝙽𝙴𝚁 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙻𝙸𝚂𝚃*
*╰───────────❒*
╭────────៚
┃✯╭──❥
┃✯│ *.ʀᴇꜱᴛᴀʀᴛ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ʀᴀᴠɪ-ɪᴅ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ʀᴀᴠɪ-ɪᴅ2*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ʙʟᴏᴄᴋʟɪꜱᴛ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ɢᴇᴛʙɪᴏ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱᴇᴛᴘᴘᴀʟʟ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱᴇᴛᴏɴʟɪɴᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱᴇᴛᴘᴘ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱᴇᴛᴍʏɴᴀᴍᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴜᴘᴅᴀᴛᴇʙɪᴏ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ɢᴇᴛᴘᴘ*
┃✬╰──❥
╰────────៚
*✬ ᴛᴏᴛᴀʟ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ 𝘖𝘞𝘕𝘌𝘙: 11*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`);
                        break;
                    case '2':
                        reply(`*╭───────────❒*
*┃* *𝙲𝙾𝙽𝚅𝙴𝚁𝚃 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙻𝙸𝚂𝚃*
*╰───────────❒*
╭────────៚
┃✯╭──❥
┃✯│ *.ᴄᴏɴᴠᴇʀᴛ*
┃✬╰──❥
╰────────៚
*✬ ᴛᴏᴛᴀʟ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ 𝘊𝘖𝘕𝘝𝘌𝘙𝘛 : 1*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`);
                        break;
                    case '3':
                        reply(`*╭───────────❒*
*┃* *𝙰𝙸 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙻𝙸𝚂𝚃*
*╰───────────❒*
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀɪ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ɢᴘᴛ*
┃✬╰──❥
╰────────៚
*✬ ᴛᴏᴛᴀʟ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ 𝘈𝘐 : 2*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`);
                        break;
                    case '4':
                        reply(`*╭───────────❒*
*┃* *𝚂𝙴𝙰𝚁𝙲𝙷 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙻𝙸𝚂𝚃*
*╰───────────❒*
╭────────៚
┃✯╭──❥
┃✯│ *.ʏᴛꜱ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴛɪᴋᴛᴏᴋꜱᴛᴀʟᴋ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱʀᴇᴘᴏ*
┃✬╰──❥
╰────────៚
*✬ ᴛᴏᴛᴀʟ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ 𝘚𝘌𝘈𝘙𝘊𝘏 : 3*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`);
                        break;
                    case '5':
                        reply(`*╭───────────❒*
*┃* *𝙳𝙾𝚆𝙽𝙻𝙾𝙰𝙳 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙻𝙸𝚂𝚃*
*╰───────────❒*
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀᴘᴋ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴠᴠ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀɴɪᴍᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴛᴡɪᴛᴛᴇʀ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ɢᴅʀɪᴠᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴍᴇᴅɪᴀꜰɪʀᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜰʙ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ɪɴꜱᴛᴀɢʀᴀᴍ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ɪɢ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴍᴏᴠɪᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱᴏɴɢ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴠɪᴅᴇᴏ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴘʟᴀʏ/ʏᴛ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱᴏɴɢ2*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴠɪᴅᴇᴏ2*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴛɪᴋᴛᴏᴋ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ɪᴍɢ*
┃✬╰──❥
╰────────៚
*✬ ᴛᴏᴛᴀʟ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ 𝘋𝘖𝘞𝘕𝘓𝘖𝘈𝘋 : 17*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`);
                        break;
                    case '6':
                        reply(`*╭───────────❒*
*┃* *𝙼𝙰𝙸𝙽 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙻𝙸𝚂𝚃*
*╰───────────❒*
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀʟɪᴠᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀʟɪᴠᴇ2*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴘɪɴɢ3*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀʙᴏᴜᴛ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴍᴇɴᴜ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ʟᴏɢᴏᴍᴇɴᴜ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴘɪɴɢ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴘɪɴɢ2*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱᴜᴘᴘᴏʀᴛ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱʏꜱᴛᴇᴍ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴜᴘᴛɪᴍᴇ*
┃✬╰──❥
╰────────៚

*✬ ᴛᴏᴛᴀʟ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ 𝘔𝘈𝘐𝘕 : 9*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`);
                        break;
                    case '7':
                        reply(`*╭───────────❒*
*┃* *𝙶𝚁𝙾𝚄𝙿 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙻𝙸𝚂𝚃*
*╰───────────❒*
╭────────៚
┃✯╭──❥
┃✯│ *.ᴘʀᴏᴍᴏᴛᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴅᴇᴍᴏᴛᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴋɪᴄᴋ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀᴅᴅ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀᴅᴍɪɴꜱ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴛᴀɢᴀʟʟ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ɢᴇᴛᴘɪᴄ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱᴇᴛᴡᴇʟᴄᴏᴍᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜱᴇᴛɢᴏᴏᴅʙʏᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴍᴜᴛᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴜɴᴍᴜᴛᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ɢɴᴀᴍᴇ*
┃✬╰──❥
╰────────៚

*✬ ᴛᴏᴛᴀʟ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ 𝘎𝘙𝘖𝘜𝘗 : 13*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`);
                        break;
                    case '8':
                        reply(`*╭───────────❒*
*┃* *𝙵𝚄𝙽 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙻𝙸𝚂𝚃*
*╰───────────❒*
╭────────៚
┃✯╭──❥
┃✯│ *.ᴅᴏɢ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ꜰᴀᴄᴛ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ʜᴀᴄᴋ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.𝚀ᴜᴏᴛᴇ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀɴɪᴍᴇɢɪʀʟ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀɴɪᴍᴇɢɪʀʟ1*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀɴɪᴍᴇɢɪʀʟ2*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀɴɪᴍᴇɢɪʀʟ3*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀɴɪᴍᴇɢɪʀʟ4*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀɴɪᴍᴇɢɪʀʟ5*
┃✬╰──❥
╰────────៚
*✬ ᴛᴏᴛᴀʟ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ 𝘍𝘜𝘕 : 10*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`);
                        break;
                    case '9':
                        reply(`*╭───────────❒*
*┃* *𝚃𝙾𝙾𝙻𝚂 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙻𝙸𝚂𝚃*
*╰───────────❒*
╭────────៚
┃✯╭──❥
┃✯│ *.ᴀɪ*
┃✬╰──❥
╰────────៚
*✬ ᴛᴏᴛᴀʟ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ 𝘈𝘐 : 1*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`);
                        break;
                    case '10':
                        reply(`*╭───────────❒*
*┃* *𝙾𝚃𝙷𝙴𝚁 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝙻𝙸𝚂𝚃*
*╰───────────❒*
╭────────៚
┃✯╭──❥
┃✯│ *.ɢɪᴛʜᴜʙꜱᴛᴀʟᴋ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴡᴇᴀᴛʜᴇʀ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴛʀᴛ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴛᴇᴍᴘᴍᴀɪʟ*
┃✬╰──❥
╰────────៚
╭────────៚
┃✯╭──❥
┃✯│ *.ᴛᴇᴍᴘɴᴜᴍ*
┃✬╰──❥
╰────────៚

*✬ ᴛᴏᴛᴀʟ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ 𝘖𝘛𝘏𝘌𝘙 : 5*

> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋɪɴɢ ʀᴀᴠɪ 💥`);
                        break;
                    default:
                        reply("❌ Invalid Option Selected!");
                }
            }
        });
    } catch (error) {
        conn.sendMessage(from, { react: { text: '❌', key: mek.key } });
        reply('An error occurred while processing your request.');
    }
});
